Tekla.Structures.Dialog.Data.Native.AppliedAttributesSelectorImports.DotExportSelectPartAppliedAttributes(Tekla.Structures.ModelInternal.dotPart_t@,Tekla.Structures.Dialog.Data.Native.dotMaterialType)
Selects the current applied values to part.
It's expected that the target type to get the applied values for,
is indicated by Tekla.Structures.ModelInternal.dotModelObject_t.Type and Tekla.Structures.ModelInternal.dotPart_t.SubType.
part: The Tekla.Structures.ModelInternal.dotPart_t instance to set the current applied values to.
dotMaterialType: The type of material of the part to select the applied values for.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.Native.AppliedAttributesSelectorImports.DotExportSelectColumnAppliedLevels(Tekla.Structures.Model.Beam.BeamTypeEnum,Tekla.Structures.Dialog.Data.Native.dotMaterialType,System.Double@,System.Double@)
Selects the current default bottom and top levels for a Tekla.Structures.Model.Beam with the given Tekla.Structures.Model.Beam.BeamTypeEnum.
beamType: The type of beam to get the current applied levels for.
dotMaterialType: The type of material of the beam to get the current applied levels for.
bottomLevel: The offset to apply on Tekla.Structures.Model.Beam.StartPoint against a specific reference location.
topLevel: The offset to apply on Tekla.Structures.Model.Beam.EndPoint against a specific reference location.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.Native.AppliedAttributesSelectorImports.DotExportCreateRebarMeshFromInputValues(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotPoint_t[],System.Int32,Tekla.Structures.ModelInternal.dotRebarMesh_t@)
Creates a Tekla.Structures.ModelInternal.dotRebarMesh_t from the given input values.
pFatherIdentifier: The identifier of the father part.
aInputPoints: The sequence of input points.
nInputPoints: The count of input points.
pDotRebarMesh: The constructed rebar mesh.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.Native.AppliedAttributesSelectorImports.DotExportSelectSingleRebarApliedAttributes(Tekla.Structures.ModelInternal.dotSingleRebar_t@)
Selects the current applied values to singleRebar.
singleRebar: The Tekla.Structures.ModelInternal.dotSingleRebar_t instance to set the current applied values to.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.Native.AppliedAttributesSelectorImports.DotExportSelectRebarGroupAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarGroup_t@)
Selects the current applied values to rebarGroup.
rebarGroup: The Tekla.Structures.ModelInternal.dotRebarGroup_t instance to set the current applied values to.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.Native.AppliedAttributesSelectorImports.DotExportSelectControlObjectAppliedAttributes(Tekla.Structures.ModelInternal.dotControlObject_t@)
Selects the current applied values to controlObject.
It's expected that the target type to get the applied values for,
is indicated by Tekla.Structures.ModelInternal.dotModelObject_t.Type and Tekla.Structures.ModelInternal.dotPart_t.SubType.
controlObject: The Tekla.Structures.ModelInternal.dotControlObject_t instance to set the current applied values to.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.Native.AppliedAttributesSelectorImports.dotExportSelectGridAppliedAttributes(Tekla.Structures.ModelInternal.dotGrid_t@)
Selects the current applied values to grid.
It's expected that the target type to get the applied values for,
is indicated by Tekla.Structures.ModelInternal.dotModelObject_t.Type.
grid: The Tekla.Structures.ModelInternal.dotGrid_t instance to set the current applied values to.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.Native.AppliedAttributesSelectorImports.DotExportSelectLoftedPlateAppliedAttributes(Tekla.Structures.ModelInternal.dotPart_t@,Tekla.Structures.Dialog.Data.Native.dotMaterialType,System.Int32@)
Selects the current applied values to part which is Tekla.Structures.Model.LoftedPlate.
It's expected that the target type to get the applied values for,
is indicated by Tekla.Structures.ModelInternal.dotModelObject_t.Type and Tekla.Structures.ModelInternal.dotPart_t.SubType.
part: The Tekla.Structures.ModelInternal.dotPart_t instance to set the current applied values to.
dotMaterialType: The type of material of the part to select the applied values for.
FaceType: Lofted plate solid face type.
Returns: Greater than zero on success; otherwise, zero.